Repository: 84000/data-translation-memory
Catalog: Toh_134-The_Absorption_That_Encapsulates_All_Merit-v2.tmx
Source language: bo
Languages: en

source: དེ་བདུད་ཀྱིས་བསླུས་ནས་ལྷག་པའི་ང་རྒྱལ་ཅན་དུ་གྱུར་ཏེ། དེ་བཞིན་གཤེགས་པའི་ཐད་དུ་མི་འགྲོ་བའི་སྟེང་དུ་ང་རྒྱལ་གྱིས་ཟིལ་གྱིས་ནོན་ནས་བྲམ་ཟེ་དང་ཁྱིམ་བདག་ཆོས་སྨྲ་བ་རྣམས་དང་། ལྷན་ཅིག་ཏུ་འཐབ་པ་དང་། རྩོད་པ་དང་། འགྱེད་པ་ལ་ཞུགས་ཏེ
en: Misled by demons, this priest developed immense pride, and so he did not make visits to the Thus-Gone One. On top of this, so overcome was he with pride, he would stay around spiritual teachers, both priests and laypeople, to fight, quarrel, and dispute with them.

source: ཆོས་དང་ཆོས་སྨྲ་བ་རྣམས་ལ་ཡང་མ་གུས་པ་བསྐྱེད་དོ། །
en: He was disrespectful to the Dharma as well as to Dharma teachers.

source: དེའི་ཚེ་དེ་ཉིད་ལ་ཆོས་ལྔ་དང་བྲལ་བར་གྱུར་ཏེ།
en: “At that time, he lacked five things.

source: སངས་རྒྱས་མཐོང་བ་དང་།
en: He had not met the Buddha,

source: ཆོས་ཐོས་པ་དང་།
en: not heard the Dharma,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་དག་དང་། འབེལ་བའི་གཏམ་སྣ་ཚོགས་དྲི་བར་བྱ་བ་དང་།
en: had not had various discussions with bodhisattva great beings who had entered the Great Vehicle,

source: དགེ་བའི་རྩ་བ་ཡོངས་སུ་བསྔོ་བ་དང་།
en: had not dedicated the roots of virtue, and

source: བྱང་ཆུབ་ཀྱི་སེམས་ཤིན་ཏུ་བརྟན་པོར་བྱ་བ་དང་བྲལ་བར་གྱུར་ནས་
en: had not stabilized the mind of awakening.

source: དེས་མི་དགེ་བའི་ཆོས་ནི་ཡོངས་སུ་བཟུང་ལ་བྱང་ཆུབ་ཀྱི་སེམས་ནི་ཡོངས་སུ་མ་བཟུང་སྟེ།
en: Thus he had taken up negative qualities, while not taking up the mind of awakening, and thereby,

source: སྲེད་མེད་ཀྱི་བུ་ཆོས་ལྔ་པོ་དེ་དག་དང་བྲལ་བར་གྱུར་ཏོ། །
en: Nārāyaṇa, did he lack these five things.

source: སྲེད་མེད་ཀྱི་བུ་དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་ནོར་བཟངས་གང་ཡིན་པ་དེ་གཞན་ཞིག་ཡིན་པར་ཁྱོད་སོམ་ཉིའམ། ཡིད་གཉིས་སམ། ཐེ་ཚོམ་ཟ་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟའོ། །
en: “Nārāyaṇa, if by any chance you have hesitations, reservations, or doubts that the brahmin priest Wealthy as the Great Sal Tree at that time, in those days, might be someone else, do not harbor them.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཚན་པོ་ཆེ་ཆེན་པོ་དྲི་མ་མེད་པའི་གཟི་བརྗིད་འདི་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་ནོར་བཟངས་སུ་གྱུར་ཏེ།
en: For at that time, in those days, it was the mighty strongman Vimalatejā who was the brahmin Wealthy as the Great Sal Tree.

source: ང་རྒྱལ་དེས་ན་དེའི་བྱང་ཆུབ་ཀྱི་སེམས་བརྗེད་དོ། །
en: Due to his pride, he neglected the mind of awakening.

source: སྔོན་གྱི་དགེ་བའི་རྩ་བས་ཡོངས་སུ་བསྲུངས་པ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་ཁོ་ནས་བསྐྱབས་པ་དེས་ནི་ངན་སོང་དག་ཏུ་མ་སྐྱེས་སོ། །
en: Yet he was protected by his previous roots of virtue and saved only by the mind of awakening; thus he was not reborn in the lower states.

source: དེ་ང་རྒྱལ་གྱིས་ཁེངས་ཏེ།
en: He was inflated with pride and

source: ཚན་པོ་ཆེ་ཆེན་པོའི་ཤུགས་ཐོབ་ཀྱང་སངས་རྒྱས་ཀྱི་མཐུས་སངས་རྒྱས་མཐོང་བ་དང་མ་བྲལ་ལོ། །
en: had the strength of a mighty strongman, yet through the Buddha’s power, he could not avoid meeting the Buddha.

source: དེ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་ཀྱི་ཤུགས་མ་བཟོད་དེ་འོངས་པ་ལས་དེ་བཞིན་གཤེགས་པ་དང་བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་ཀྱི་ཤུགས་ཐོས་ནས་
en: Overwhelmed by the powerful force of the Thus-Gone One, he came here, and he heard of the powerful strength of the Thus-Gone One and the bodhisattvas.

source: ང་རྒྱལ་དང་། རྒྱགས་པ་དང་། དྲེགས་པ་ཐམས་ཅད་ཡོངས་སུ་ཆད་དོ། །
en: Thereby all his pride, conceit, and arrogance were eliminated.

source: སྡིག་པ་མ་བྱས་པའི་ཕྱིར་ནི་དེ་བཞིན་གཤེགས་པ་མཐོང་ངོ་། །
en: Since he did nothing harmful, he met the Thus-Gone One.

source: དེའི་སྔོན་གྱི་རྒྱུ་ལས་བྱུང་བའི་དགེ་བའི་རྩ་བ་མངོན་དུ་བྱུང་སྟེ།
en: This was a root of virtue that manifested from causes in the past;

source: དེས་ན་མངོན་པར་ཤེས་པ་མྱུར་ལ་བཟོད་པ་ཐོབ་བོ། །
en: thus was he able to swiftly attain acceptance of the superknowledges.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྲེད་མེད་ཀྱི་བུས་ཚན་པོ་ཆེ་ཆེན་པོ་དྲི་མ་མེད་པའི་གཟི་བརྗིད་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Then the bodhisattva Nārāyaṇa asked the mighty strongman Vimalatejā,

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཆོས་གང་བསྐྱེད་ན། དེས་ཁྱོད་ཀྱིས་བཟོད་པ་ཐོབ་པར་གྱུར།
en: “Son of noble family, what qualities have you engendered to achieve such acceptance?”

source: དྲི་མ་མེད་པའི་གཟི་བརྗིད་ཀྱིས་སྨྲས་པ།
en: To this Vimalatejā answered,

source: བདག་གིས་སོ་སོའི་སྐྱེ་བོའི་ཆོས་ཐམས་ཅད་བསྐྱེད་དོ། །
en: “I have engendered all the qualities of an ordinary being.”

source: སྲེད་མེད་ཀྱི་བུས་སྨྲས་པ།
en: Nārāyaṇa continued,

source: ཁྱོད་ཀྱིས་ཇི་ལྟར་བསྐྱེད།
en: “How did you engender them?”

source: ཇི་ལྟར་འབྱུང་བ་མེད་པ་དང་། འཇིག་པ་མེད་པ་དེ་ལྟར་བསྐྱེད་དོ། །
en: “Just as they do not come into being and just as they do not perish, that is how I engendered them.

source: ཇི་ལྟར་མངོན་པར་ཞེན་པ་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་དེ་ལྟར་བསྐྱེད་དོ། །
en: Just as they cannot be grasped and just as they are unborn, that is how I engendered them.”

source: རིགས་ཀྱི་བུ་སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་ཁྱད་པར་ནི་ཅི་ཞིག་ཡོད།
en: “Son of noble family, what is the difference between the qualities of ordinary beings and the qualities of buddhas?

source: ཐ་དད་དུ་དབྱེ་བ་ནི་ཅི་ཞིག་ཡོད།
en: What distinguishes them?”

source: མིང་ལ་ནི་ཐ་དད་དུ་དབྱེ་བ་ཡོད་ཀྱི་དོན་ལ་ནི་ཐ་དད་དུ་ནི་དབྱེ་བ་མེད་དོ། །
en: “They are distinguished in name, though in fact there is no real distinction.”

source: དྲི་མ་མེད་པའི་གཟི་བརྗིད་སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་ཀྱི་དོན་གང་ཡིན།
en: “Vimalatejā, what is truly meant by the qualities of ordinary beings?”

source: དེའི་དོན་ནི་མེད་པ་ལས་ཡོངས་སུ་བརྟགས་པ་དང་། རྣམ་པར་རྟོག་པ་མེད་པའོ། །
en: “They have no true meaning; there is nothing designated and no concept.”

source: དྲི་མ་མེད་པའི་གཟི་བརྗིད་དོན་གྱིས་ནི་ཅི་ཞིག་སེལ་བར་བྱེད།
en: “Vimalatejā, what does the true meaning eliminate?

source: ཅི་ཞིག་ནི་སྒྲུབ་པར་བྱེད།
en: What does the true meaning establish?”

source: སྲེད་མེད་ཀྱི་བུ་དོན་གྱིས་ནི་སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་སེལ་བར་བྱེད་དོ། །
en: “Nārāyaṇa, the true meaning eliminates the qualities of ordinary beings

source: སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ནི་སྒྲུབ་པར་བྱེད་དོ། །
en: and establishes the qualities of the buddhas.”

source: དྲི་མ་མེད་པའི་གཟི་བརྗིད་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་དོན་གང་ཡིན།
en: “Vimalatejā, what is truly meant by the qualities of the buddhas?”

source: སྲེད་མེད་ཀྱི་བུ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་དོན་ནི་གཉིས་སུ་དབྱེར་མེད་པའོ། །
en: “Nārāyaṇa, the true meaning of the qualities of the buddhas is nonduality.”

source: རིགས་ཀྱི་བུ་དོན་ལ་རྟོན་པར་བྱའི་ཚིག་འབྲུ་ལ་རྟོན་པར་མི་བྱའོ། །ཞེས་དེ་བཞིན་གཤེགས་པས་གསུངས་པ་དང་།
en: “The Thus-Gone One has declared, ‘Son of noble family, rely on the true meaning, do not rely on the words.’

source: ཡང་དག་པའི་ལྟ་བ་སྐྱེ་བ་ལ་ནི་རྒྱུ་གཉིས་དང་། རྐྱེན་གཉིས་ཡོད་དེ།
en: He has also stated, ‘There are two causes and circumstances for the correct view to arise,

source: གཞན་གྱི་སྒྲ་དང་། རང་གི་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པའོ་ཞེས་གསུངས་ན།
en: namely other’s words, and one’s own correct mental engagement.’

source: ཇི་ལྟར་ཚིག་འབྲུ་ཡང་དེ་ཉིད་ཡིན་ལ། དོན་ཀྱང་དེ་ཉིད་ཡིན།
en: So how would you explain what are words and what is meaning ?”

source: སྲེད་མེད་ཀྱི་བུ་དོན་ལ་རྟོན་པའི་བྱང་ཆུབ་སེམས་དཔས་ནི་ཚིག་འབྲུ་ཕྲི་བ་ཡང་མེད་དོ། །
en: “Nārāyaṇa, a bodhisattva relying on the true meaning does not reduce his words.

source: ཡང་ཚིག་འབྲུ་དམིགས་སུ་མེད་པ་དེ་ནི་དོན་ཡིན་ལ།
en: Moreover, that words have no reference point is their true meaning.

source: དོན་དེ་ཡང་བརྗོད་དུ་མེད་པའི་དོན་ཡིན་ནོ། །
en: Their true meaning is the true meaning that is inexpressible.

source: དོན་ལ་རྟོན་པ་ལ་ནི་ཆོས་ཀྱང་ཅི་ཡང་མེད་དོ། །
en: For one relying on the true meaning, there are no phenomena whatsoever,

source: དོན་ཀྱང་ཅི་ཡང་མེད་དོ། །
en: and also no true meaning.

source: ཆོས་ཐམས་ཅད་ནི་བརྗོད་དུ་མེད་པ་དང་། ཡ་མ་བརླ་དང་། ཡུལ་ན་མི་གནས་པ་དང་། ཕྱོགས་ན་མི་གནས་པ་དང་། གང་ཁོ་ན་ན་གནས་པ་དེ་ཁོ་ནར་འགགས་པའི་ཕྱིར་རོ། །
en: It is because all phenomena are inexpressible, worthless, not dwelling in any place or direction, remaining in themselves and ceasing in themselves.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་དོན་ནི་གཏན་དུ་འགོག་པའི་མཚན་ཉིད་དོ་ཞེས་གསུངས་ཏེ།
en: The Blessed One has also stated, ‘The definition of the true meaning is perpetual cessation.’

source: སྲེད་མེད་ཀྱི་བུ་དེ་ལྟ་བས་ན་གང་དོན་ལ་རྟོན་པ་དེ་ནི་ཆོས་གང་ལས་ཀྱང་མི་འཕྲོ་རྣམ་པར་མི་འཕྲོའོ། །
en: Therefore, Nārāyaṇa, one who relies on the true meaning does not proliferate or elaborate on anything.

source: གང་མི་འཕྲོ་བ་རྣམ་པར་མི་འཕྲོ་བ་དེ་ནི་དོན་ཏོ། །
en: That which is not proliferated or elaborated is the true meaning.”

source: རིགས་ཀྱི་བུ་གང་དོན་ལ་རྟོན་པ་དེ་ཆོས་ཐམས་ཅད་ལ་རྟོན་པའི་རྣམ་གྲངས་ཡོད་དམ།
en: “Son of noble family, is there a system according to which relying on the true meaning is to rely on all phenomena?”

source: སྲེད་མེད་ཀྱི་བུ་ཡོད་དེ
en: “There is, Nārāyaṇa.

source: འདི་ལྟར་ཆོས་ཐམས་ཅད་ནི་སྟོང་པ། ཆོས་ཐམས་ཅད་ནི་དབེན་པ་སྟེ།
en: It is in the sense that all phenomena are empty, that all phenomena are void.

source: དེ་དག་ནི་ཆོས་ཐམས་ཅད་ཇི་ལྟར་སྟོང་པ་དེ་ཁོ་ན་བཞིན་དུ་དེ་ལ་རྟོན་ཏོ། །
en: It is precisely in the sense that they are empty that they are to be relied on.

source: ཇི་ལྟར་དབེན་པ་དེ་ཁོ་ན་བཞིན་དུ་དེ་ལ་རྟོན་ཏོ། །
en: It is precisely in the sense that they are void that they are to be relied on.

source: སྲེད་མེད་ཀྱི་བུ་དེ་ལྟར་ན་གང་དོན་ལ་རྟོན་པ་དེ་ནི་ཆོས་ཐམས་ཅད་ལ་རྟོན་ཏོ། །
en: In this way, Nārāyaṇa, the one who relies on the true meaning relies on all phenomena.”

source: དྲི་མ་མེད་པའི་གཟི་བརྗིད་དེ་ལྟ་བས་ན་ཆོས་ཐམས་ཅད་ཉིད་རྟོན་པ་ཡིན་ནོ། །
en: “Therefore, Vimalatejā, all phenomena are dependent.”

source: སྲེད་མེད་ཀྱི་བུ་དེ་ནི་དེ་བཞིན་ནོ། །
en: “Precisely, Nārāyaṇa.

source: ཆོས་ཐམས་ཅད་ནི་དོན་དམ་པ་ལ་རྟོན་པ་ཡིན་ནོ། །
en: All phenomena depend on the ultimate truth.

source: དོན་དམ་པ་ནི་དེ་དག་གི་སྒོ་ཡིན་ཏེ།
en: They have their gateway in the ultimate truth.

source: དོན་དམ་པར་དེ་དག་བཙལ་བར་བྱ་བ་ཡིན་ནོ། །
en: We should pursue them within the ultimate truth.

source: ཇི་ལྟར་ཆོས་ཀྱང་མི་བསྒྲུབ། ཆོས་མ་ཡིན་པའང་མི་བསྒྲུབ་པ་དེ་ལྟར་དེ་དག་བཙལ་བར་བྱའོ། །
en: We should pursue them in the sense that just as phenomena are not established, nor is the absence of phenomena established.

source: གཉིས་སུ་མེད་པ་བཙལ་བ་ནི་འཕགས་པ་རྣམས་ཀྱི་བཙལ་བ་ཡིན་ནོ། །
en: The noble ones’ pursuit is a nondualistic pursuit.

source: བཙལ་བ་དེ་ནི་བྱེད་པ་མེད་པའོ། །
en: This pursuit does not involve doing anything.

source: བཙལ་བ་དེ་ནི་བྱ་བ་མ་ཡིན།
en: In this pursuit, there is nothing to be done,

source: རྣམ་པར་བྱ་བ་མ་ཡིན་ནོ། །
en: nothing to be carried out.

source: གང་གི་ཚེ་མི་བྱེད་ཅིང་རྣམ་པར་མི་བྱེད་པ་དེའི་ཚེ་བཙལ་བ་བྱས་པ་ཡིན་ནོ། །
en: The pursuit is taking place when there is nothing being done, nothing being carried out.

source: གལ་ཏེ་དོན་དང་འགལ་བར་མི་བྱེད་ན། བཙལ་བར་བྱ་བའི་འོས་ཡིན་ནོ། །
en: As long as one does not go against the true meaning, it is appropriate to strive.”

source: དེ་ནས་ཚན་པོ་ཆེ་ཆེན་པོ་དྲི་མ་མེད་པའི་གཟི་བརྗིད་ཀྱིས་དོན་འདི་བསྟན་པ་ན་དགེ་སློང་ལྔ་བརྒྱ་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ། །
en: As the mighty strongman Vimalatejā expounded on the true meaning, the minds of five hundred monks became freed of defilement and without grasping.

source: ལྷའི་བུ་བརྒྱད་སྟོང་ནི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་གོ། །
en: Eight thousand gods purified the eye of Dharma regarding phenomena so that it became cleared of dust and immaculate.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྲེད་མེད་ཀྱི་བུས་བྱང་ཆུབ་སེམས་དཔའ་དྲི་མ་མེད་པའི་གཟི་བརྗིད་ལ་གཞན་ཡང་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The bodhisattva great being Nārāyaṇa then told Vimalatejā,

source: དྲི་མ་མེད་པའི་གཟི་བརྗིད་དེ་བཞིན་གཤེགས་པས་དོན་ལ་རྟོན་པར་བྱའི་ཚིག་འབྲུ་ལ་མ་ཡིན་ཞེས་གསུངས་པ་དེ་ནི།
en: “Vimalatejā, the Thus-Gone One declared, ‘Rely on the true meaning. Don’t rely on the words.’

source: སེམས་ཅན་འདི་དག་དོན་ལ་མི་མཁས་ཤིང་གཉིས་ལ་སྤྱོད་པ་དང་།
en: This is because beings lack skill in the true meaning and experience things dualistically.

source: ཚིག་འབྲུ་ལའང་མི་མཁས་པས་ཚིག་འབྲུ་ལ་སྒྲོ་འདོགས་ཤིང་དོན་མི་ཤེས་པའི་ཕྱིར་དེ་དག་ལ་དོན་ལ་རྟོན་པར་བྱའི་ཚིག་འབྲུ་ལ་མ་ཡིན་ཞེས་དེ་བཞིན་གཤེགས་པས་གསུངས་ཏེདེ་དག་དོན་ལ་རྟོན་པས་ཚིག་འབྲུའི་རང་བཞིན་མཉམ་པ་ཉིད་དུ་རྟོགས་པས་ཚིག་འབྲུ་ལས་ཡང་དག་པར་འདའ་བར་འགྱུར་རོ། །
en: They also lack skill concerning words, misinterpreting them and failing to understand their true meaning. Thus the Thus-Gone One advised them to rely on the true meaning and not on the words. That way, by relying on the true meaning, they will understand that the very nature of words is sameness, and they will then transcend words altogether.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པའི་ལྟ་བ་སྐྱེ་བ་ལ་ནི་རྒྱུ་གཉིས་དང་། རྐྱེན་གཉིས་ཡོད་དོ་ཞེས་དེ་སྐད་གསུངས་པ་དེ་ནི་འདི་ལྟར་ཆོས་འདུལ་བ་མ་ཐོས་པས་ཏིང་ངེ་འཛིན་ཙམ་གྱིས་ཆོག་པར་འཛིན་པ་དེ་དག་འཁོར་བ་ལས་རྣམ་པར་མ་གྲོལ་བཞིན་དུ་རང་བཞིན་གྱིས་མངོན་པའི་ང་རྒྱལ་ཅན་ཡིན་ཏེརང་བཞིན་གྱིས་མངོན་པའི་ང་རྒྱལ་ཅན་དེ་དག་ཐོས་པ་མང་པོ་ལ་གཟུད་པའི་ཕྱིར་ཏེ། དེ་དག་གིས་ཆོས་ཐོས་ནས་གལ་ཏེ་ཚུལ་བཞིན་དུ་བསྒྲུབ་ན་ནི་དེ་དག་ཀྱང་ལྷག་པའི་ང་རྒྱལ་མེད་པར་འགྱུར་ཏེ།
en: “Son of noble family, those who assume that absorption alone is sufficient and do not learn the teachings of the vinaya will not become free of cyclic existence, since their attitude is pretentious by nature. The Thus-Gone One’s statement that there are two causes or circumstances that lead to the genuine view is thus intended to draw such people who are pretentious by nature into extensive learning. If they then learn the teachings and practice them correctly, their pretense will go away.

source: ལམ་ལ་གནས་པ་དེ་ལ་དགོངས་ནས་བཅོམ་ལྡན་འདས་ཀྱིས།
en: With those on the path in mind, the Blessed One declared:

source: ཐོས་པས་ཆོས་རྣམས་ཤེས་པར་འགྱུར། །
en: “ ‘Through learning, one will comprehend dharmas.

source: ཐོས་པས་སྡིག་པ་བྱེད་མི་འགྱུར། །
en: Through learning, one will not do evil.

source: ཐོས་པས་གནོད་པ་སྤང་བར་འགྱུར། །
en: Through learning, one will give up harm.

source: ཐོས་པས་མྱ་ངན་འདའ་བ་འཐོབ། །
en: Through learning, one will gain nirvāṇa.’ ”

source: བྱང་ཆུབ་སེམས་དཔའ་སྲེད་མེད་ཀྱི་བུས་སྨྲས་པ།
en: The bodhisattva Nārāyaṇa then asked,

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་ན་དགེ་སློང་རྣལ་འབྱོར་སྤྱོད་པ་ཚུལ་བཞིན་དུ་ཆོས་ལ་སྦྱོར་བ་ཡིན།
en: “Son of noble family, how should a monk practitioner engage with the Dharma in a genuine way?”

source: གང་དུ་ཡང་སྦྱོར་བ་མེད་ལ་འབྲལ་བར་ཡང་མི་བྱེད་ན། དེ་ལྟར་ན་ཚུལ་བཞིན་དུ་ཆོས་ལ་སྦྱོར་བ་ཡིན་ནོ། །
en: “If one never engages with the Dharma and is never separate from it, that is the way to genuinely engage with the Dharma.

source: སྲེད་མེད་ཀྱི་བུ་ཚུལ་བཞིན་དུ་སྦྱོར་བ་ཞེས་བྱ་བ་དེ་ནི་སྦྱོར་བ་མེད་པའི་ཚིག་བླ་དགས་སོ། །
en: Nārāyaṇa, genuine engagement with the Dharma refers to an absence of engagement.

source: སྲེད་མེད་ཀྱི་བུ་གཞན་ཡང་གང་གི་ཚེ་དགེ་སློང་སྦྱོར་བར་མི་བྱེད་ན་ཉེས་པ་ཀུན་ནས་སློང་བར་མི་བྱེད། བདག་ཀུན་ནས་སློང་བར་མི་བྱེད་དེ། དེ་ནི་དེའི་ཚུལ་བཞིན་དུ་སྦྱོར་བའོ། །
en: Furthermore, Nārāyaṇa, when a monk does not engage, he does not activate any faults, nor does he activate the self: this is genuine engagement.

source: གང་གི་ཚེ་སྔོན་གྱིས་མཐའ་དང་ཕྱི་མའི་མཐའ་ལ་སོ་སོར་རྟོག་སྟེ། གང་ལ་སྨྲ་བ་དང་། གང་སྨྲ་བར་བྱ་བ་དང་། གང་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་ཕྱིར་སྨྲ་བ་དང་། གང་སྤང་བའི་ཕྱིར་སྨྲ་བ་དང་། གང་རྟོགས་པར་བྱ་བའི་ཕྱིར་སྨྲ་བ་དང་། གང་བསྒོམ་པའི་ཕྱིར་སྨྲ་བ་དེ་དག་ཐམས་ཅད་འདས་པའི་རྒྱུས་འཐོབ་པ་མ་ཡིན། མ་འོངས་པའི་རྒྱུས་འཐོབ་པ་མ་ཡིན། ད་ལྟར་བྱུང་བའི་རྒྱུས་འཐོབ་པ་མ་ཡིན་པ་འདི་ནི་ཚུལ་བཞིན་དུ་སྦྱོར་བ་ཞེས་བྱའོ། །
en: When we analyze in terms of beginning and end, then the one being spoken to, the topic of discussion, the understanding aimed at in the discussion, and explanations of what should be abandoned, what should be realized, and what meditation should be done, are all found not to have a past cause, a future cause, or a present cause—that is genuine engagement.

source: གང་གི་ཚེ་ཆོས་ཐམས་ཅད་ངོ་བོ་ཉིད་ཀྱིས་འགགས་པར་མཐོང་བ་དེའི་ཚེ་ཚུལ་བཞིན་དུ་མཐོང་བ་ཡིན་ནོ། །
en: “When one sees that all phenomena have essentially ceased, that is genuine seeing.

source: གང་གི་ཚེ་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་རྣམ་པར་ཞི་བ་དང་། རང་བཞིན་གྱིས་སྙོམས་པར་ཞུགས་པར་མཐོང་བ་དེའི་ཚེ། ཚུལ་བཞིན་དུ་མཐོང་བ་ཡིན་ནོ། །
en: When one sees that all phenomena are naturally at peace and naturally in a state of union, that is genuine seeing.

source: གང་གི་ཚེ་ཆོས་ཐམས་ཅད་གཏན་དུ་མ་སྐྱེས་པར་མཐོང་བ་དེའི་ཚེ་ཚུལ་བཞིན་དུ་མཐོང་བ་ཡིན་ནོ། །
en: When one sees that all phenomena have never originated, that is genuine seeing.

source: གང་གི་ཚེ་ཆོས་ཐམས་ཅད་གཏན་དུ་མ་སྐྱེས་པ་དང་། གཏན་དུ་མ་བྱུང་བ་དང་། གཏན་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་མཐོང་བ་དང་། གང་གིས་མཐོང་བ་དང་། གང་མཐོང་བ་དེ་ཡང་མི་མཐོང་བ་དང་། ཇི་ལྟར་མི་མཐོང་བ་དང་། རྣམ་པར་མི་མཐོང་བ་དེ་ལྟར་མཐོང་ན་ཚུལ་བཞིན་དུ་མཐོང་བ་ཞེས་བྱའོ། །
en: When one sees that all phenomena have never originated nor arisen, and sees that they are entirely beyond suffering, and one does not see one who is seeing and something seen, and does not see them as they are, and does not see them at all—when one so sees, that is genuine seeing.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚན་པོ་ཆེ་ཆེན་པོ་དྲི་མ་མེད་པའི་གཟི་བརྗིད་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: At this, the Blessed One said to the mighty strongman Vimalatejā, “Excellent.

source: རིགས་ཀྱི་བུ་ལེགས་སོ་ལེགས་སོ། །
en: Excellent, son of noble family, excellent.

source: གལ་ཏེ་བསྟན་ནམ་བསྟན་པ་ན་དེ་ལྟར་བསྟན་པར་བྱའོ། །
en: If something is taught or to be taught, it should be taught in this way.

source: ཚུལ་བཞིན་དུ་བརྩོན་པ་ནི་ཆོས་གང་ལ་ཡང་རྨོངས་པ་མེད་དོ། །
en: To exert oneself in the correct way is to become undeluded about everything.

source: ཚུལ་བཞིན་དུ་བརྩོན་པ་ནི་ཆོས་གང་ལ་ཡང་སྒྲིབ་པ་མེད་དོ། །
en: To exert oneself in the correct way is to be unobscured about everything.

source: ཚུལ་བཞིན་དུ་བརྩོན་པ་ནི་གང་དུ་ཡང་བཅིངས་པ་ཡང་མེད་གྲོལ་བ་ཡང་མེད་དོ། །
en: To exert oneself in the correct way is to be beyond bondage and liberation.

source: ཚུལ་བཞིན་དུ་བརྩོན་པ་ནི་ཆོས་གང་ཡང་སྤང་བའམ། འབྲལ་བར་བྱ་བའི་ཕྱིར་འབད་པ་མེད་དོ། །
en: It is because correct exertion involves no effort to abandon or be rid of anything.

source: གང་ཆོས་ཐམས་ཅད་ཡང་དག་པར་མཐོང་བ་དང་། ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་བ་དེ་ནི་དེའི་ཡང་དག་པར་ལྟ་བ་ཡིན་ནོ། །
en: To see all phenomena genuinely, to see them as they truly are, is genuine vision.

source: ཆོས་རྣམས་ལ་ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་བ་གང་ཞེ་ན།
en: “What does it mean to see phenomena as they truly are?

source: མཐོང་བ་མེད་པ་ཁོ་ནའོ། །
en: It is non-seeing alone.

source: མཐོང་བ་མེད་པ་ཞེས་བྱ་བ་དེ་ནི་མ་སྐྱེས་པའི་ཚིག་བླ་དགས་སོ། །
en: Non-seeing is a reference to non-origination .

source: མ་སྐྱེས་པ་ཞེས་བྱ་བ་དེ་ནི་མ་བྱུང་བའི་ཚིག་བླ་དགས་སོ། །
en: Non-origination is a reference to non-arising.

source: མ་བྱུང་བ་ཞེས་བྱ་བ་དེ་ནི་མ་མཐོང་བའི་ཚིག་བླ་དགས་ཏེ།
en: Non-arising is a reference to non-seeing.

source: ངས་དེ་ལས་དགོངས་ནས་ཚིག་འདི་སྐད་དུ་ཆོས་ཐམས་ཅད་མ་སྐྱེས་མ་མཐོང་ན་ཡང་དག་པ་ཉིད་སྐྱོན་མེད་པ་ལ་འཇུག་པར་འགྱུར་རོ་ཞེས་གསུངས་སོ། །
en: It was because I had this in mind that you declared, ‘When all phenomena are not originating and not seen, one will penetrate flawless reality.’

source: འདི་ནི་ཡང་དག་པའི་ལྟ་བ་སྟེ། འདི་ལྟ་སྟེ། ཡང་དག་པ་ཉིད་སྐྱོན་མེད་པ་ལ་འཇུག་པའོ། །
en: This is genuine vision—to penetrate flawless reality.

source: ཅིའི་ཕྱིར་ཡང་དག་པ་ཉིད་སྐྱོན་མེད་པ་ལ་འཇུག་པ་ཞེས་བྱ་ཞེ་ན།
en: Why do we use the phrase penetrate flawless reality ?

source: བདག་མཉམ་པ་གང་ཡིན་པ་དེ་ནི་བདག་མེད་པའི་མཉམ་པའོ། །
en: That which is the sameness of self is the sameness of non-self.

source: བདག་མེད་པའི་མཉམ་པ་གང་ཡིན་པ་དེ་ནི་ཆོས་ཐམས་ཅད་མཉམ་པ་སྟེ།
en: That which is the sameness of non-self is the sameness of all phenomena.

source: དེ་བས་ན་ཡང་དག་པ་ཉིད་སྐྱོན་མེད་པ་ལ་འཇུག་པ་ཞེས་བྱའོ། །
en: Hence the expression penetrate flawless reality .”

source: བཅོམ་ལྡན་འདས་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཐམས་ཅད་འདི་ལྟ་བུའི་མཚན་ཉིད་དང་། རང་བཞིན་གྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་ཚུལ་དུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡང་དག་པར་ཤེས་ཤིང་ཐོས་ལ་ཡིད་ཆེས་ཤིང་མོས་སུ་ལགས་ཀྱང་། བར་མ་དོར་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་མི་འགྱུར་བ་ནི་བཅོམ་ལྡན་འདས་ངོ་མཚར་ལགས་སོ། །
en: “Blessed One, a bodhisattva may correctly understand this Dharma discourse regarding how all phenomena have such characteristics, and how they are inherently and entirely beyond suffering; upon hearing it, he or she may then believe and be convinced of it. That he or she nevertheless does not pass beyond suffering in the interval period is indeed marvelous, Blessed One.

source: བདེ་བར་གཤེགས་པ་ངོ་མཚར་ལགས་སོ། །
en: Bliss-Gone One, it is indeed marvelous.”

source: སྲེད་མེད་ཀྱི་བུ་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཐབས་ལ་མཁས་པ་དེ་དག་ནི་
en: “Nārāyaṇa, such is the skill in method of these bodhisattvas.

source: ཐབས་མཁས་པ་དེ་དང་ལྡན་པས་སེམས་བསྐྱེད་པ་ཐམས་ཅད་ལ་ཆོས་བཞིས་ཡོངས་སུ་སྒོ་བར་བྱེད་དེ
en: Being so skilled in methods, they suffuse every mind-state they have with four things.

source: བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་དང་། སངས་རྒྱས་འབྱུང་བས་ཆོས་ཀྱི་ཚུལ་རྒྱུན་མི་འཆད་པར་བྱ་བ་སྟེ།
en: Great love, great compassion, omniscient wisdom, and the uninterrupted preservation of the spiritual tradition after the Buddha has appeared.

source: སྲེད་མེད་ཀྱི་བུ་ཆོས་བཞི་པོ་དེ་དག་གིས་ཆོས་ཐམས་ཅད་ཡོངས་སུ་སྒོ་བར་བྱེད་དེ།
en: “Nārāyaṇa, they apply these four to everything.

source: ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་ཤེས་ཤིང་
en: They perfectly understand how all phenomena are inherently beyond suffering.

source: ཐོས་ལ་ཡིད་ཆེས་ཤིང་མོས་སུ་ཟིན་ཀྱང་བར་མ་དོར་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་མི་འགྱུར་རོ། །
en: They have belief and conviction in what they have heard. Yet still they do not pass beyond suffering in the interval period.

source: དེས་སེམས་ཅན་རྣམས་ཀྱི་དོན་གྱི་ཕྱིར་ཆོས་འདུལ་བ་འདི་ཤེས་ཏེ།
en: They learn the teachings of the vinaya for the sake of beings.

source: ཤེས་ཤིང་མཐོང་ལ་ངེས་པ་ནི་མི་མཐོང་ངོ་། །
en: Their certainty in understanding and seeing is one of non-seeing.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མ་བཏང་བའི་ཕྱིར་རོ། །
en: Why is that? Because they do not give up on any being.”

source: བཅོམ་ལྡན་འདས་བཅོམ་ལྡན་འདས་ཀྱིས་ངེས་པར་ལྟུང་བར་འགྱུར་རོ་ཞེས་དེ་སྐད་གསུངས་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་དེ་གང་ལགས།
en: “Blessed One, what faults do bodhisattvas have, those whom the Blessed One described as certain to fall ?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ནི་སྐྱོན་གང་ཡིན་པའི་ལྟ་བར་གྱུར་པ་ཡང་ཅི་ཡང་མེད་ལ་རྣམ་པར་རྟོག་པ་ཡང་ཅི་ཡང་མེད་མོད་ཀྱི།
en: The Blessed One replied, “Son of noble family, I do not at all regard bodhisattvas as having any faults, and do not have any such concepts whatsoever. Nevertheless,

source: འོན་ཀྱང་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་དམིགས་པ་བྱས་ནས་སེམས་ཅན་ཐམས་ཅད་ལ་མ་དམིགས།
en: they may focus on the vehicle of the śrāvakas instead of focusing on all sentient beings,

source: སངས་རྒྱས་ཀྱི་རིགས་ལ་མ་དམིགས།
en: instead of focusing on the lineage of the Buddha,

source: ཆོས་དང་དགེ་འདུན་གྱི་རིགས་ལ་མ་དམིགས།
en: instead of focusing on [the lineage of the Buddha], the lineage of the Dharma, the lineage of the Saṅgha, [and the Great Vehicle].

source: ཐེག་པ་ཆེན་པོ་ལ་མ་དམིགས་ཏེ།
en: instead of focusing on [the lineage of the Buddha, the lineage of the Dharma, the lineage of the Saṅgha, and] the Great Vehicle.

source: ཐམས་ཅད་མཁྱེན་པ་ཡལ་བར་བོར་ནས་མི་ལྟ་བ་དང་།
en: They may neglect and disregard the state of omniscience.

source: ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་མི་འདེབས་པ་དང་།
en: They may fail to make aspirations to completely and perfectly awaken.

source: འདུས་བྱས་ཐམས་ཅད་ལ་སྐྱོ་བས་ཉན་ཐོས་ཀྱི་སྐྱོན་མེད་པ་ལ་འཇུག་པར་བྱེད་དོ། །
en: Developing aversion to everything that is composite, they might enter the faultlessness of the śrāvakas.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་དམིགས་པ་བྱས་ཏེ།
en: “Bodhisattva great beings should keep their focus on all beings;

source: དཀོན་མཆོག་གསུམ་གྱི་རིགས་ལ་དམིགས་པ་བྱས་ཞིང་ཐེག་པ་ཆེན་པོ་ལ་དམིགས་པ་བྱས་ནས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་ལྟ་སྟེ། ལུས་དང་སྲོག་ལ་མི་ལྟའོ། །
en: they should keep their focus on the lineage of the Three Jewels and on the Great Vehicle, and thereby look to the wisdom of omniscience, and have no regard for life and limb.

source: ཆོས་ཐམས་ཅད་མཚན་ཉིད་གཅིག་པར་ཤེས་ཀྱང་སྐྱོན་མེད་པ་ལ་འཇུག་པར་མི་བྱེད།
en: They should understand the single characteristic of all phenomena, and yet not enter faultlessness.

source: སེམས་ཅན་ལ་ལྟ་བའི་ཕྱིར་བསམ་གཏན་ཡང་འདྲིས་པར་བྱེད་ལ།
en: Out of their regard for beings, they should familiarize themselves with concentration.

source: ཉན་ཐོས་ཀྱི་སྐྱོན་མེད་པར་ཡང་མི་ལྟུང་སྟེ།
en: And they should not let themselves enter the faultlessness of śrāvakas.
